In [39]:
# importing the require lib
import pandas as pd
import numpy as np

In [6]:
df=pd.read_csv(r'C:\Users\Dell\3D Objects\Assignment Lets upgrade\1.Titanic\titanic.csv')
#importing the .csv file 

df.head()     # To view the top 5 entries

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
df.tail() #To view the last 5 entries

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
df.describe() #To check the min,max,count etc

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [12]:
df.dtypes  #To check the datatypes of the entries in the Column

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [13]:
df.drop(['PassengerId'],axis=1,inplace=True)
# To drop the  column that is not usefull in analysis

In [14]:
df.drop(['Name'],axis=1,inplace=True)

In [15]:
df.drop(['Ticket'],axis=1,inplace=True)

In [16]:
df.drop(['Cabin'],axis=1,inplace=True)

In [17]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  34.5      0      0   7.8292        Q
1         1       3  female  47.0      1      0   7.0000        S
2         0       2    male  62.0      0      0   9.6875        Q
3         0       3    male  27.0      0      0   8.6625        S
4         1       3  female  22.0      1      1  12.2875        S

In [18]:
df.shape  #To check the total no of rows and columnms

(418, 8)

In [20]:
df.columns #To Check the heading of the columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [21]:
df['Parch'].unique() #to check the different number entries in the particular column

array([0, 1, 3, 2, 4, 6, 5, 9], dtype=int64)

In [22]:
df['Embarked'].unique()

array(['Q', 'S', 'C'], dtype=object)

In [23]:
df[['Survived', 'Age']]

     Survived   Age
0           0  34.5
1           1  47.0
2           0  62.0
3           0  27.0
4           1  22.0
..        ...   ...
413         0   NaN
414         1  39.0
415         0  38.5
416         0   NaN
417         0   NaN

[418 rows x 2 columns]

In [25]:
df1=(df['Survived']==0)
df1.head()

0     True
1    False
2     True
3     True
4    False
Name: Survived, dtype: bool

In [26]:
df1=(df['Survived']=0)
df1.head()

SyntaxError: invalid syntax (<ipython-input-26-b8017ef668c6>, line 1)

In [28]:
df[(df['Survived']<1)]

     Survived  Pclass   Sex   Age  SibSp  Parch      Fare Embarked
0           0       3  male  34.5      0      0    7.8292        Q
2           0       2  male  62.0      0      0    9.6875        Q
3           0       3  male  27.0      0      0    8.6625        S
5           0       3  male  14.0      0      0    9.2250        S
7           0       2  male  26.0      1      1   29.0000        S
..        ...     ...   ...   ...    ...    ...       ...      ...
407         0       1  male  50.0      1      1  211.5000        C
413         0       3  male   NaN      0      0    8.0500        S
415         0       3  male  38.5      0      0    7.2500        S
416         0       3  male   NaN      0      0    8.0500        S
417         0       3  male   NaN      1      1   22.3583        C

[266 rows x 8 columns]

In [32]:
df2=df[(df['Survived']<1)]
df2.tail()

     Survived  Pclass   Sex   Age  SibSp  Parch      Fare Embarked
407         0       1  male  50.0      1      1  211.5000        C
413         0       3  male   NaN      0      0    8.0500        S
415         0       3  male  38.5      0      0    7.2500        S
416         0       3  male   NaN      0      0    8.0500        S
417         0       3  male   NaN      1      1   22.3583        C

In [37]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 266 entries, 0 to 417
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  266 non-null    int64
 1   Pclass    266 non-null    int64
 2   Sex       266 non-null    object
 3   Age       205 non-null    float64
 4   SibSp     266 non-null    int64
 5   Parch     266 non-null    int64
 6   Fare      265 non-null    float64
 7   Embarked  266 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 18.7+ KB